<template>
  <div class="wrapper">
    <ul class="content">
      <li>我是文字列表1</li>
      <li>我是文字列表2</li>
      <li>我是文字列表3</li>
      <li>我是文字列表4</li>
      <li>我是文字列表5</li>
      <li>我是文字列表6</li>
      <li>我是文字列表7</li>
      <li>我是文字列表8</li>
      <li>我是文字列表9</li>
      <li>我是文字列表10</li>
      <li>我是文字列表11</li>
      <li>我是文字列表12</li>
      <li>我是文字列表13</li>
      <li>我是文字列表14</li>
      <li>我是文字列表15</li>
      <li>我是文字列表16</li>
      <li>我是文字列表17</li>
      <li>我是文字列表18</li>
      <li>我是文字列表19</li>
      <li>我是文字列表20</li>
      <li>我是文字列表21</li>
      <li>我是文字列表22</li>
      <li>我是文字列表23</li>
      <li>我是文字列表24</li>
      <li>我是文字列表25</li>
      <li>我是文字列表26</li>
      <li>我是文字列表27</li>
      <li>我是文字列表28</li>
      <li>我是文字列表29</li>
      <li>我是文字列表30</li>
      <li>我是文字列表31</li>
      <li>我是文字列表32</li>
      <li>我是文字列表33</li>
      <li>我是文字列表34</li>
      <li>我是文字列表35</li>
      <li>我是文字列表36</li>
      <li>我是文字列表37</li>
      <li>我是文字列表38</li>
      <li>我是文字列表39</li>
      <li>我是文字列表40</li>
      <li>我是文字列表41</li>
      <li>我是文字列表42</li>
      <li>我是文字列表43</li>
      <li>我是文字列表44</li>
      <li>我是文字列表45</li>
      <li>我是文字列表46</li>
      <li>我是文字列表47</li>
      <li>我是文字列表48</li>
      <li>我是文字列表49</li>
      <li>我是文字列表50</li>
      <li>我是文字列表51</li>
      <li>我是文字列表52</li>
      <li>我是文字列表53</li>
      <li>我是文字列表54</li>
      <li>我是文字列表55</li>
      <li>我是文字列表56</li>
      <li>我是文字列表57</li>
      <li>我是文字列表58</li>
      <li>我是文字列表59</li>
      <li>我是文字列表60</li>
      <li>我是文字列表61</li>
      <li>我是文字列表62</li>
      <li>我是文字列表63</li>
      <li>我是文字列表64</li>
      <li>我是文字列表65</li>
      <li>我是文字列表66</li>
      <li>我是文字列表67</li>
      <li>我是文字列表68</li>
      <li>我是文字列表69</li>
      <li>我是文字列表70</li>
      <li>我是文字列表71</li>
      <li>我是文字列表72</li>
      <li>我是文字列表73</li>
      <li>我是文字列表74</li>
      <li>我是文字列表75</li>
      <li>我是文字列表76</li>
      <li>我是文字列表77</li>
      <li>我是文字列表78</li>
      <li>我是文字列表79</li>
      <li>我是文字列表80</li>
      <li>我是文字列表81</li>
      <li>我是文字列表82</li>
      <li>我是文字列表83</li>
      <li>我是文字列表84</li>
      <li>我是文字列表85</li>
      <li>我是文字列表86</li>
      <li>我是文字列表87</li>
      <li>我是文字列表88</li>
      <li>我是文字列表89</li>
      <li>我是文字列表90</li>
      <li>我是文字列表91</li>
      <li>我是文字列表92</li>
      <li>我是文字列表93</li>
      <li>我是文字列表94</li>
      <li>我是文字列表95</li>
      <li>我是文字列表96</li>
      <li>我是文字列表97</li>
      <li>我是文字列表98</li>
      <li>我是文字列表99</li>
      <li>我是文字列表100</li>
    </ul>
  </div>
</template>

<script>
  import BScroll from 'better-scroll'
  export default {

    // 组件创建完虚拟dom，挂载完模板后调用
    mounted() {
      new BScroll(".wrapper", {
    })
    }
  }
</script>

<style>
  .wrapper {
    background-color:aqua;
    height: 150px;
    /* overflow-y: scroll;   局部滚动样式 */
  }
</style>